{"format": "graph-model", "generatedBy": "1.13.1", "convertedBy": "TensorFlow.js Converter v1.2.7", "modelTopology": {"node": [{"name": "ppo_agent/ppo2_model/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ppo_agent/ppo2_model/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ppo_agent/ppo2_model/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "ppo_agent/ppo2_model/vf/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/vf/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "1"}]}}}}}, {"name": "ppo_agent/ppo2_model/pi/concatenate_both/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ppo_agent/ppo2_model/pi/human_dense_final_6/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "ppo_agent/ppo2_model/pi/human_dense_final_6/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/human_dense_0/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/human_dense_0/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1125"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/flatten_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "ppo_agent/ppo2_model/pi/human_conv_0/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}}}, {"name": "ppo_agent/ppo2_model/pi/human_conv_0/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "25"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/human_conv_initial/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/human_conv_initial/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "6"}, {"size": "20"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/Ob", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "30"}, {"size": "9"}, {"size": "5"}, {"size": "20"}]}}}}, {"name": "ppo_agent/ppo2_model/pi/final_robot_action/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/final_robot_action/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "6"}]}}}}}, {"name": "ppo_agent/ppo2_model/pi/merged_0/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/merged_0/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "134"}, {"size": "64"}]}}}}}, {"name": "ppo_agent/ppo2_model/pi/robot_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/robot_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "ppo_agent/ppo2_model/pi/robot_0/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/robot_0/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1125"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_0/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_0/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "25"}, {"size": "25"}]}}}}}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_initial/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_initial/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "6"}, {"size": "20"}, {"size": "25"}]}}}}}, {"name": "ppo_agent/ppo2_model/pi/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/ArgMax/dimension", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ppo_agent/ppo2_model/Shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "ppo_agent/ppo2_model/pi/human_conv_initial/Conv2D", "op": "Conv2D", "input": ["ppo_agent/ppo2_model/Ob", "ppo_agent/ppo2_model/pi/human_conv_initial/kernel"], "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_initial/Conv2D", "op": "Conv2D", "input": ["ppo_agent/ppo2_model/Ob", "ppo_agent/ppo2_model/pi/robot_conv_initial/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "ppo_agent/ppo2_model/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["ppo_agent/ppo2_model/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "T": {"type": "DT_INT32"}, "seed": {"i": "9456"}, "seed2": {"i": "213"}}}, {"name": "ppo_agent/ppo2_model/pi/human_conv_initial/BiasAdd", "op": "BiasAdd", "input": ["ppo_agent/ppo2_model/pi/human_conv_initial/Conv2D", "ppo_agent/ppo2_model/pi/human_conv_initial/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_initial/BiasAdd", "op": "BiasAdd", "input": ["ppo_agent/ppo2_model/pi/robot_conv_initial/Conv2D", "ppo_agent/ppo2_model/pi/robot_conv_initial/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "ppo_agent/ppo2_model/Log", "op": "Log", "input": ["ppo_agent/ppo2_model/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/human_conv_initial/LeakyRelu", "op": "LeakyRelu", "input": ["ppo_agent/ppo2_model/pi/human_conv_initial/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_initial/LeakyRelu", "op": "LeakyRelu", "input": ["ppo_agent/ppo2_model/pi/robot_conv_initial/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/Neg", "op": "Neg", "input": ["ppo_agent/ppo2_model/Log"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/human_conv_0/Conv2D", "op": "Conv2D", "input": ["ppo_agent/ppo2_model/pi/human_conv_initial/LeakyRelu", "ppo_agent/ppo2_model/pi/human_conv_0/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_0/Conv2D", "op": "Conv2D", "input": ["ppo_agent/ppo2_model/pi/robot_conv_initial/LeakyRelu", "ppo_agent/ppo2_model/pi/robot_conv_0/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "ppo_agent/ppo2_model/Log_1", "op": "Log", "input": ["ppo_agent/ppo2_model/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/human_conv_0/BiasAdd", "op": "BiasAdd", "input": ["ppo_agent/ppo2_model/pi/human_conv_0/Conv2D", "ppo_agent/ppo2_model/pi/human_conv_0/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_0/BiasAdd", "op": "BiasAdd", "input": ["ppo_agent/ppo2_model/pi/robot_conv_0/Conv2D", "ppo_agent/ppo2_model/pi/robot_conv_0/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/human_conv_0/LeakyRelu", "op": "LeakyRelu", "input": ["ppo_agent/ppo2_model/pi/human_conv_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_0/LeakyRelu", "op": "LeakyRelu", "input": ["ppo_agent/ppo2_model/pi/robot_conv_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "ppo_agent/ppo2_model/pi/human_flatten/Reshape", "op": "Reshape", "input": ["ppo_agent/ppo2_model/pi/human_conv_0/LeakyRelu", "ppo_agent/ppo2_model/flatten_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/robot_flatten/Reshape", "op": "Reshape", "input": ["ppo_agent/ppo2_model/pi/robot_conv_0/LeakyRelu", "ppo_agent/ppo2_model/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "ppo_agent/ppo2_model/pi/human_dense_0/MatMul", "op": "MatMul", "input": ["ppo_agent/ppo2_model/pi/human_flatten/Reshape", "ppo_agent/ppo2_model/pi/human_dense_0/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "ppo_agent/ppo2_model/pi/robot_0/MatMul", "op": "MatMul", "input": ["ppo_agent/ppo2_model/pi/robot_flatten/Reshape", "ppo_agent/ppo2_model/pi/robot_0/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "ppo_agent/ppo2_model/pi/human_dense_0/BiasAdd", "op": "BiasAdd", "input": ["ppo_agent/ppo2_model/pi/human_dense_0/MatMul", "ppo_agent/ppo2_model/pi/human_dense_0/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "ppo_agent/ppo2_model/pi/robot_0/BiasAdd", "op": "BiasAdd", "input": ["ppo_agent/ppo2_model/pi/robot_0/MatMul", "ppo_agent/ppo2_model/pi/robot_0/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "ppo_agent/ppo2_model/pi/human_dense_0/LeakyRelu", "op": "LeakyRelu", "input": ["ppo_agent/ppo2_model/pi/human_dense_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "ppo_agent/ppo2_model/pi/robot_0/LeakyRelu", "op": "LeakyRelu", "input": ["ppo_agent/ppo2_model/pi/robot_0/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/human_dense_final_6/MatMul", "op": "MatMul", "input": ["ppo_agent/ppo2_model/pi/human_dense_0/LeakyRelu", "ppo_agent/ppo2_model/pi/human_dense_final_6/kernel"], "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "ppo_agent/ppo2_model/pi/robot_1/MatMul", "op": "MatMul", "input": ["ppo_agent/ppo2_model/pi/robot_0/LeakyRelu", "ppo_agent/ppo2_model/pi/robot_1/kernel"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "ppo_agent/ppo2_model/pi/human_dense_final_6/BiasAdd", "op": "BiasAdd", "input": ["ppo_agent/ppo2_model/pi/human_dense_final_6/MatMul", "ppo_agent/ppo2_model/pi/human_dense_final_6/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/robot_1/BiasAdd", "op": "BiasAdd", "input": ["ppo_agent/ppo2_model/pi/robot_1/MatMul", "ppo_agent/ppo2_model/pi/robot_1/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/human_dense_final_6/LeakyRelu", "op": "LeakyRelu", "input": ["ppo_agent/ppo2_model/pi/human_dense_final_6/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/robot_1/LeakyRelu", "op": "LeakyRelu", "input": ["ppo_agent/ppo2_model/pi/robot_1/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/concatenate_both", "op": "ConcatV2", "input": ["ppo_agent/ppo2_model/pi/robot_1/LeakyRelu", "ppo_agent/ppo2_model/pi/human_dense_0/LeakyRelu", "ppo_agent/ppo2_model/pi/human_dense_final_6/LeakyRelu", "ppo_agent/ppo2_model/pi/concatenate_both/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, {"name": "ppo_agent/ppo2_model/pi/merged_0/MatMul", "op": "MatMul", "input": ["ppo_agent/ppo2_model/pi/concatenate_both", "ppo_agent/ppo2_model/pi/merged_0/kernel"], "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "ppo_agent/ppo2_model/pi/merged_0/BiasAdd", "op": "BiasAdd", "input": ["ppo_agent/ppo2_model/pi/merged_0/MatMul", "ppo_agent/ppo2_model/pi/merged_0/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/merged_0/LeakyRelu", "op": "LeakyRelu", "input": ["ppo_agent/ppo2_model/pi/merged_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "ppo_agent/ppo2_model/pi/final_robot_action/MatMul", "op": "MatMul", "input": ["ppo_agent/ppo2_model/pi/merged_0/LeakyRelu", "ppo_agent/ppo2_model/pi/final_robot_action/kernel"], "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "ppo_agent/ppo2_model/pi/final_robot_action/BiasAdd", "op": "BiasAdd", "input": ["ppo_agent/ppo2_model/pi/final_robot_action/MatMul", "ppo_agent/ppo2_model/pi/final_robot_action/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/final_robot_action/LeakyRelu", "op": "LeakyRelu", "input": ["ppo_agent/ppo2_model/pi/final_robot_action/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi/concat", "op": "ConcatV2", "input": ["ppo_agent/ppo2_model/pi/final_robot_action/LeakyRelu", "ppo_agent/ppo2_model/pi/human_dense_final_6/LeakyRelu", "ppo_agent/ppo2_model/pi/concatenate_both/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/vf/MatMul", "op": "MatMul", "input": ["ppo_agent/ppo2_model/pi/concat", "ppo_agent/ppo2_model/vf/w"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi_1/MatMul", "op": "MatMul", "input": ["ppo_agent/ppo2_model/pi/concat", "ppo_agent/ppo2_model/pi/w"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/vf/add", "op": "Add", "input": ["ppo_agent/ppo2_model/vf/MatMul", "ppo_agent/ppo2_model/vf/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/pi_1/add", "op": "Add", "input": ["ppo_agent/ppo2_model/pi/b", "ppo_agent/ppo2_model/pi_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/strided_slice_2", "op": "StridedSlice", "input": ["ppo_agent/ppo2_model/vf/add", "ppo_agent/ppo2_model/strided_slice/stack", "ppo_agent/ppo2_model/strided_slice_2/stack_1", "ppo_agent/ppo2_model/strided_slice/stack_2"], "attr": {"end_mask": {"i": "1"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "ppo_agent/ppo2_model/Softmax", "op": "Softmax", "input": ["ppo_agent/ppo2_model/pi_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/sub", "op": "Sub", "input": ["ppo_agent/ppo2_model/pi_1/add", "ppo_agent/ppo2_model/Log_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/value", "op": "Identity", "input": ["ppo_agent/ppo2_model/strided_slice_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/action_probs", "op": "Identity", "input": ["ppo_agent/ppo2_model/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ppo_agent/ppo2_model/ArgMax", "op": "ArgMax", "input": ["ppo_agent/ppo2_model/sub", "ppo_agent/ppo2_model/ArgMax/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}, {"name": "ppo_agent/ppo2_model/action", "op": "Identity", "input": ["ppo_agent/ppo2_model/ArgMax"], "attr": {"T": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "ppo_agent/ppo2_model/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "ppo_agent/ppo2_model/strided_slice_2/stack_1", "shape": [2], "dtype": "int32"}, {"name": "ppo_agent/ppo2_model/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "ppo_agent/ppo2_model/vf/b", "shape": [1], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/vf/w", "shape": [12, 1], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/concatenate_both/axis", "shape": [], "dtype": "int32"}, {"name": "ppo_agent/ppo2_model/pi/human_dense_final_6/bias", "shape": [6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/human_dense_final_6/kernel", "shape": [64, 6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/human_dense_0/bias", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/human_dense_0/kernel", "shape": [1125, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "ppo_agent/ppo2_model/pi/human_conv_0/bias", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/human_conv_0/kernel", "shape": [3, 3, 25, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/human_conv_initial/bias", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/human_conv_initial/kernel", "shape": [6, 6, 20, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/final_robot_action/bias", "shape": [6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/final_robot_action/kernel", "shape": [64, 6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/merged_0/bias", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/merged_0/kernel", "shape": [134, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/robot_1/bias", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/robot_1/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/robot_0/bias", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/robot_0/kernel", "shape": [1125, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_0/bias", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_0/kernel", "shape": [3, 3, 25, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_initial/bias", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/robot_conv_initial/kernel", "shape": [6, 6, 20, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/w", "shape": [12, 6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/b", "shape": [6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/ArgMax/dimension", "shape": [], "dtype": "int32"}, {"name": "ppo_agent/ppo2_model/Shape", "shape": [2], "dtype": "int32"}]}]}