{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.7", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "DummyLayer", "config": {"name": "dummy_layer", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_1", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_2", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_3", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_4", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_5", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_6", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_7", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_8", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_9", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_10", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_11", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_12", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_13", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_14", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_15", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_16", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_17", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_18", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_19", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_20", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_21", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_22", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_23", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_24", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_25", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_26", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_27", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_28", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_29", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_30", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_31", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_32", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_33", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_34", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_35", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_36", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_37", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_38", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_39", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_40", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_41", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_42", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_43", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_44", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_45", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_46", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_47", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_48", "trainable": true, "dtype": null}}, {"class_name": "DummyLayer", "config": {"name": "dummy_layer_49", "trainable": true, "dtype": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "ppo_agent/ppo2_model/pi/conv_initial/kernel", "shape": [5, 5, 20, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_initial/bias", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_2/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_2/bias", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/w", "shape": [64, 6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/b", "shape": [6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/vf/w", "shape": [64, 1], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/vf/b", "shape": [1], "dtype": "float32"}, {"name": "beta1_power", "shape": [], "dtype": "float32"}, {"name": "beta2_power", "shape": [], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_initial/kernel/Adam", "shape": [5, 5, 20, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_initial/kernel/Adam_1", "shape": [5, 5, 20, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_0/kernel", "shape": [3, 3, 25, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_initial/bias/Adam", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_initial/bias/Adam_1", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_0/kernel/Adam", "shape": [3, 3, 25, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_0/kernel/Adam_1", "shape": [3, 3, 25, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_0/bias/Adam", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_0/bias/Adam_1", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_1/kernel/Adam", "shape": [3, 3, 25, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_1/kernel/Adam_1", "shape": [3, 3, 25, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_1/bias/Adam", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_1/bias/Adam_1", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_0/bias", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense/kernel/Adam", "shape": [150, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense/kernel/Adam_1", "shape": [150, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense/bias/Adam", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense/bias/Adam_1", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_1/kernel/Adam", "shape": [64, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_1/kernel/Adam_1", "shape": [64, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_1/bias/Adam", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_1/bias/Adam_1", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_2/kernel/Adam", "shape": [64, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_2/kernel/Adam_1", "shape": [64, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_1/kernel", "shape": [3, 3, 25, 25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_2/bias/Adam", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_2/bias/Adam_1", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/w/Adam", "shape": [64, 6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/w/Adam_1", "shape": [64, 6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/b/Adam", "shape": [6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/b/Adam_1", "shape": [6], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/vf/w/Adam", "shape": [64, 1], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/vf/w/Adam_1", "shape": [64, 1], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/vf/b/Adam", "shape": [1], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/vf/b/Adam_1", "shape": [1], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/conv_1/bias", "shape": [25], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense/kernel", "shape": [150, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense/bias", "shape": [64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_1/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "ppo_agent/ppo2_model/pi/dense_1/bias", "shape": [64], "dtype": "float32"}]}]}